app/Controllers/SiswaController.php

    public function index()
    {
        //model initialize
        $siswaModel = new SiswaModel();

        //pager initialize
        $pager = \Config\Services::pager();

        $data = array(
            'siswass' => $siswaModel->paginate(10, 'siswa'),
            'pager' => $siswaModel->pager
        );
---
SELECT *
FROM `siswa`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `siswa`